zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_ospi.c
/*
 * Copyright (c) 2025 EXALT Technologies
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * **************************************************************************
 * MSPI flash controller driver for stm32 series with multi-SPI peripherals
 * This driver is based on the stm32Cube HAL OSPI driver
 * with one mspi DTS node.
 * **************************************************************************
 */
#define DT_DRV_COMPAT st_stm32_ospi_controller

#include <zephyr/cache.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/flash.h>
#include <zephyr/drivers/mspi.h>
#include <zephyr/drivers/dma/dma_stm32.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/device_runtime.h>
#include <zephyr/pm/policy.h>
#include <zephyr/irq.h>
#include <zephyr/logging/log.h>
#include <stm32_bitops.h>
#include <stm32_ll_dma.h>
#include "mspi_stm32.h"

/*
 * Map a DT_INST ordinal to the hardware OCTOSPI instance number (1, 2, ...).
 *
 * COND_CODE_1(DT_NODE_EXISTS(...)) is evaluated entirely by the preprocessor
 * and emits the ternary arm only when the node label exists in the current DTS.
 * This avoids expanding DT_NODELABEL(octospiN) on chips that have fewer
 * instances, making the macro portable across all STM32 OCTOSPI variants.
 *
 * The result is a stacked ternary whose trailing 0 (unknown node) is caught at
 * compile time by BUILD_ASSERT in MSPI_STM32_INIT.
 */
#define OSPI_INST_NUM(index)                                                           \
	(IF_ENABLED(DT_NODE_EXISTS(DT_NODELABEL(octospi1)),                            \
		(DT_SAME_NODE(DT_DRV_INST(index), DT_NODELABEL(octospi1)) ? 1 :))      \
	IF_ENABLED(DT_NODE_EXISTS(DT_NODELABEL(octospi2)),                             \
		(DT_SAME_NODE(DT_DRV_INST(index), DT_NODELABEL(octospi2)) ? 2 :))      \
	0)

/*
 * OSPIM-specific macros: HAL_OSPIM_IOPORT_* constants are only defined by the
 * STM32 HAL when the OCTOSPI I/O Manager peripheral is present.  Guard them so
 * the driver compiles cleanly on chips without OCTOSPIM (e.g. STM32L4/L5).
 */
#if defined(OCTOSPIM)
#define DT_OSPI_IO_PORT_PROP_OR(prop, default_value, index)                          \
	COND_CODE_1(DT_INST_NODE_HAS_PROP(index, prop),                              \
		    (_CONCAT(HAL_OSPIM_, DT_INST_STRING_TOKEN(index, prop))),         \
		    (default_value))

#define OSPI_INST_IO_LOW_PORT(index)                              \
	((OSPI_INST_NUM(index) == 1) ? HAL_OSPIM_IOPORT_1_LOW :  \
	 (OSPI_INST_NUM(index) == 2) ? HAL_OSPIM_IOPORT_2_LOW :  \
	 HAL_OSPIM_IOPORT_1_LOW)

#define OSPI_INST_IO_HIGH_PORT(index)                              \
	((OSPI_INST_NUM(index) == 1) ? HAL_OSPIM_IOPORT_1_HIGH :  \
	 (OSPI_INST_NUM(index) == 2) ? HAL_OSPIM_IOPORT_2_HIGH :  \
	 HAL_OSPIM_IOPORT_1_HIGH)
#else
/* No OCTOSPIM: io port fields are unused; provide neutral zero values. */
#define DT_OSPI_IO_PORT_PROP_OR(prop, default_value, index) 0
#define OSPI_INST_IO_LOW_PORT(index)  0
#define OSPI_INST_IO_HIGH_PORT(index) 0
#endif /* OCTOSPIM */

LOG_MODULE_REGISTER(ospi_stm32, CONFIG_MSPI_LOG_LEVEL);

static void ospi_lock_thread(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	k_sem_take(&dev_data->thread_sem, K_FOREVER);
}

static void ospi_unlock_thread(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	k_sem_give(&dev_data->thread_sem);
}

static int mspi_stm32_ospi_context_lock(struct mspi_stm32_context *ctx,
					const struct mspi_dev_id *req, const struct mspi_xfer *xfer,
					bool lockon)
{
	ARG_UNUSED(lockon);
	if (k_sem_take(&ctx->lock, K_MSEC(xfer->timeout)) < 0) {
		return -EBUSY;
	}
	ctx->xfer = *xfer;
	ctx->packets_left = ctx->xfer.num_packet;

	return 0;
}

static void mspi_stm32_ospi_context_unlock(struct mspi_stm32_context *ctx)
{
	k_sem_give(&ctx->lock);
}

/**
 * Check if the MSPI bus is busy.
 *
 * @param controller MSPI emulation controller device.
 * @return true The MSPI bus is busy.
 * @return false The MSPI bus is idle.
 */
static bool mspi_stm32_ospi_is_inp(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;

	return k_sem_count_get(&dev_data->ctx.lock) == 0;
}

static uint32_t mspi_stm32_ospi_hal_address_size(uint8_t address_length)
{
	if (address_length == 4U) {
		return HAL_OSPI_ADDRESS_32_BITS;
	}

	return HAL_OSPI_ADDRESS_24_BITS;
}

/*
 * Gives a OSPI_RegularCmdTypeDef with all parameters set
 * except Instruction, Address, NbData
 */
static OSPI_RegularCmdTypeDef mspi_stm32_ospi_prepare_cmd(uint8_t cfg_mode, uint8_t cfg_rate)
{
	/* Command empty structure */
	OSPI_RegularCmdTypeDef cmd_tmp = {0};

	cmd_tmp.OperationType = HAL_OSPI_OPTYPE_COMMON_CFG;
	cmd_tmp.InstructionSize =
		((cfg_mode == MSPI_IO_MODE_OCTAL) && (cfg_rate != MSPI_DATA_RATE_S_D_D))
			? HAL_OSPI_INSTRUCTION_16_BITS
			: HAL_OSPI_INSTRUCTION_8_BITS;
	cmd_tmp.InstructionDtrMode = (cfg_rate == MSPI_DATA_RATE_DUAL)
					     ? HAL_OSPI_INSTRUCTION_DTR_ENABLE
					     : HAL_OSPI_INSTRUCTION_DTR_DISABLE;

	cmd_tmp.AlternateBytesMode = HAL_OSPI_ALTERNATE_BYTES_NONE;
	cmd_tmp.AddressDtrMode = (cfg_rate == MSPI_DATA_RATE_SINGLE) ? HAL_OSPI_ADDRESS_DTR_DISABLE
								     : HAL_OSPI_ADDRESS_DTR_ENABLE;
	cmd_tmp.DataDtrMode = (cfg_rate == MSPI_DATA_RATE_SINGLE) ? HAL_OSPI_DATA_DTR_DISABLE
								  : HAL_OSPI_DATA_DTR_ENABLE;
	/* AddressWidth must be set to 32bits for init and mem config phase */
	cmd_tmp.AddressSize = HAL_OSPI_ADDRESS_32_BITS;
	cmd_tmp.DQSMode =
		(cfg_rate == MSPI_DATA_RATE_SINGLE) ? HAL_OSPI_DQS_DISABLE : HAL_OSPI_DQS_ENABLE;
	cmd_tmp.SIOOMode = HAL_OSPI_SIOO_INST_EVERY_CMD;

	switch (cfg_mode) {
	case MSPI_IO_MODE_OCTAL:
		cmd_tmp.InstructionMode = HAL_OSPI_INSTRUCTION_8_LINES;
		cmd_tmp.AddressMode = HAL_OSPI_ADDRESS_8_LINES;
		cmd_tmp.DataMode = HAL_OSPI_DATA_8_LINES;
		break;
	case MSPI_IO_MODE_QUAD:
		cmd_tmp.InstructionMode = HAL_OSPI_INSTRUCTION_4_LINES;
		cmd_tmp.AddressMode = HAL_OSPI_ADDRESS_4_LINES;
		cmd_tmp.DataMode = HAL_OSPI_DATA_4_LINES;
		break;
	case MSPI_IO_MODE_QUAD_1_4_4:
		cmd_tmp.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = HAL_OSPI_ADDRESS_4_LINES;
		cmd_tmp.DataMode = HAL_OSPI_DATA_4_LINES;
		break;
	case MSPI_IO_MODE_QUAD_1_1_4:
		cmd_tmp.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = HAL_OSPI_ADDRESS_1_LINE;
		cmd_tmp.DataMode = HAL_OSPI_DATA_4_LINES;
		break;
	case MSPI_IO_MODE_DUAL:
		cmd_tmp.InstructionMode = HAL_OSPI_INSTRUCTION_2_LINES;
		cmd_tmp.AddressMode = HAL_OSPI_ADDRESS_2_LINES;
		cmd_tmp.DataMode = HAL_OSPI_DATA_2_LINES;
		break;
	case MSPI_IO_MODE_DUAL_1_2_2:
		cmd_tmp.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = HAL_OSPI_ADDRESS_2_LINES;
		cmd_tmp.DataMode = HAL_OSPI_DATA_2_LINES;
		break;
	case MSPI_IO_MODE_DUAL_1_1_2:
		cmd_tmp.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = HAL_OSPI_ADDRESS_1_LINE;
		cmd_tmp.DataMode = HAL_OSPI_DATA_2_LINES;
		break;
	default:
		cmd_tmp.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = HAL_OSPI_ADDRESS_1_LINE;
		cmd_tmp.DataMode = HAL_OSPI_DATA_1_LINE;
		break;
	}

	return cmd_tmp;
}

static bool mspi_stm32_ospi_is_memorymap(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	return stm32_reg_read_bits(&dev_data->hmspi.ospi.Instance->CR, OCTOSPI_CR_FMODE) ==
	       OCTOSPI_CR_FMODE;
}

static int mspi_stm32_ospi_memmap_off(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;

	if (HAL_OSPI_Abort(&dev_data->hmspi.ospi) != HAL_OK) {
		LOG_ERR("MemMapped abort failed");
		return -EIO;
	}
	return 0;
}

static int mspi_stm32_ospi_memmap_on(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;
	OSPI_RegularCmdTypeDef s_command =
		mspi_stm32_ospi_prepare_cmd(dev_data->dev_cfg.io_mode, dev_data->dev_cfg.data_rate);
	OSPI_MemoryMappedTypeDef s_MemMappedCfg = {0};
	HAL_StatusTypeDef hal_ret;

	if (mspi_stm32_ospi_is_memorymap(controller)) {
		return 0;
	}
	/* Configure in MemoryMapped mode */
	if ((dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE) &&
	    (mspi_stm32_ospi_hal_address_size(dev_data->dev_cfg.addr_length) ==
	     HAL_OSPI_ADDRESS_24_BITS)) {
		/* OPI mode and 3-bytes address size not supported by memory */
		LOG_ERR("MSPI_IO_MODE_SINGLE in 3Bytes addressing is not supported");
		return -EIO;
	}

	/* Initialize the read command */
	s_command.OperationType = HAL_OSPI_OPTYPE_READ_CFG;
	s_command.Instruction = dev_data->dev_cfg.read_cmd;
	s_command.AddressSize =
		(dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
			? mspi_stm32_ospi_hal_address_size(dev_data->dev_cfg.addr_length)
			: HAL_OSPI_ADDRESS_32_BITS;
	s_command.DummyCycles = dev_data->dev_cfg.rx_dummy;

	if (HAL_OSPI_Command(&dev_data->hmspi.ospi, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) !=
	    HAL_OK) {
		LOG_ERR("Failed to set memory map %d", dev_data->hmspi.ospi.ErrorCode);
		return -EIO;
	}

	/* Initialize the program command */
	s_command.OperationType = HAL_OSPI_OPTYPE_WRITE_CFG;
	s_command.Instruction = dev_data->dev_cfg.write_cmd;
	s_command.DummyCycles = dev_data->dev_cfg.tx_dummy;
#if defined(CONFIG_SOC_SERIES_STM32U5X)
	/* STM32U5 errata 2.6.1: DQSE must be set in WCCR for memory-mapped writes
	 * even when the memory has no physical DQS pin, otherwise every write
	 * in memory-mapped mode returns an AHB error response (Bus Fault).
	 */
	s_command.DQSMode = HAL_OSPI_DQS_ENABLE;
#endif

	hal_ret =
		HAL_OSPI_Command(&dev_data->hmspi.ospi, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to set memory mapped");
		return -EIO;
	}

	/* Enable the memory-mapping.
	 * The inactivity timeout is only needed when the OCTOSPI I/O Manager
	 * is in multiplexed mode (OCTOSPI1/OCTOSPI2 share pins) — only then a
	 * peripheral must release nCS so the other one can drive the bus.
	 * MUXEN is set by HAL_OSPIM_Config() based on the DTS port mapping, so
	 * reading it here gives the actual hardware state and avoids a separate
	 * DT property that could drift out of sync.
	 */
#if defined(OCTOSPIM) && defined(OCTOSPIM_CR_MUXEN_Msk)
	if ((OCTOSPIM->CR & OCTOSPIM_CR_MUXEN_Msk) != 0U) {
		LOG_DBG("Detected OSPI muxed mode, set timeout.");
		s_MemMappedCfg.TimeOutActivation = HAL_OSPI_TIMEOUT_COUNTER_ENABLE;
		s_MemMappedCfg.TimeOutPeriod = 0x34;
	} else {
		s_MemMappedCfg.TimeOutActivation = HAL_OSPI_TIMEOUT_COUNTER_DISABLE;
	}
#else
	s_MemMappedCfg.TimeOutActivation = HAL_OSPI_TIMEOUT_COUNTER_DISABLE;
#endif

	hal_ret = HAL_OSPI_MemoryMapped(&dev_data->hmspi.ospi, &s_MemMappedCfg);
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to enable memory mapped");
		return -EIO;
	}

	LOG_DBG("Memory mapped mode enabled at 0x%x", dev_data->memmap_base_addr);

