zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_ospi.c
	return 0;
}

static int mspi_stm32_ospi_memmap_read(const struct device *dev,
				       const struct mspi_xfer_packet *packet)
{
	struct mspi_stm32_data *dev_data = dev->data;
	uintptr_t mmap_addr = dev_data->memmap_base_addr +
		dev_data->memmap_cfg.address_offset +
		packet->address;
	int ret = 0;

	ospi_lock_thread(dev);
	if (!mspi_stm32_ospi_is_memorymap(dev)) {
		ret = mspi_stm32_ospi_memmap_on(dev);
		if (ret != 0) {
			LOG_ERR("Failed to set memory-mapped before read");
			ospi_unlock_thread(dev);
			return ret;
		}
		k_usleep(50);
	}
	ospi_unlock_thread(dev);

	/* TODO :
	 * - check this mmap_addr does not exceed the max_mmap_addr = dev_data->memmap_base_addr +
	 * dev_data->memmap_cfg.address_offset + dev_data->memmap_cfg.size
	 * - check that the mmap_addr + packet->num_bytes does not exceed the max_mmap_addr
	 */

#ifdef CONFIG_DCACHE
		/* Invalidating an un-aligned cache line is safe as data cache cannot be more
		 * recent than flash memory when reading. Compute aligned address to be safe
		 * against possibles sanity tests in data cache management functions.
		 */
		uintptr_t base = ROUND_DOWN(mmap_addr, CONFIG_DCACHE_LINE_SIZE);
		uintptr_t end = ROUND_UP(mmap_addr + packet->num_bytes, CONFIG_DCACHE_LINE_SIZE);

		sys_cache_data_invd_range((void *)base, end - base);
#endif

	memcpy(packet->data_buf, (uint8_t *)mmap_addr, packet->num_bytes);
	LOG_INF("Memory-mapped read from 0x%08lx, len %u", mmap_addr, packet->num_bytes);
	return ret;
}

static int mspi_stm32_ospi_memmap_write(const struct device *dev,
					const struct mspi_xfer_packet *packet)
{
	struct mspi_stm32_data *dev_data = dev->data;
	uintptr_t mmap_addr = dev_data->memmap_base_addr +
		dev_data->memmap_cfg.address_offset +
		packet->address;
	int ret = 0;

	ospi_lock_thread(dev);
	if (!mspi_stm32_ospi_is_memorymap(dev)) {
		ret = mspi_stm32_ospi_memmap_on(dev);
		if (ret != 0) {
			LOG_ERR("Failed to set memory-mapped before write");
			ospi_unlock_thread(dev);
			return ret;
		}
		k_usleep(50);
	}
	ospi_unlock_thread(dev);

	/* Write enable and status polling are performed by the flash
	 * driver through separate command packets, which are serviced
	 * in indirect mode.
	 */
	LOG_INF("Memory-mapped write from 0x%08lx, len %u", mmap_addr, packet->num_bytes);
	memcpy((uint8_t *)mmap_addr, packet->data_buf, packet->num_bytes);

#ifdef CONFIG_DCACHE
	sys_cache_data_flush_range((void *)(mmap_addr),	packet->num_bytes);
#endif

	return ret;
}

static int mspi_stm32_ospi_abort_memmap_if_enabled(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;
	int ret = 0;

	if (dev_data->memmap_cfg.enable && mspi_stm32_ospi_is_memorymap(dev)) {
		ret = mspi_stm32_ospi_memmap_off(dev);
		if (ret != 0) {
			LOG_ERR("%s: Failed to abort memory-mapped", dev->name);
		}
	}

	return ret;
}

/* Send a Command to the NOR and Receive/Transceive data if relevant in IT or DMA mode */
static int mspi_stm32_ospi_access(const struct device *dev, const struct mspi_xfer_packet *packet,
				  uint8_t access_mode)
{

	struct mspi_stm32_data *dev_data = dev->data;
	HAL_StatusTypeDef hal_ret;

	if (dev_data->memmap_cfg.enable) {
		if ((packet->cmd == MSPI_NOR_CMD_WREN) || (packet->cmd == MSPI_NOR_OCMD_WREN) ||
		    (packet->cmd == MSPI_NOR_CMD_SE_4B) || (packet->cmd == MSPI_NOR_OCMD_SE) ||
		    (packet->cmd == MSPI_NOR_CMD_SE) ||
		    ((mspi_stm32_ospi_hal_address_size(dev_data->dev_cfg.addr_length) ==
		      HAL_OSPI_ADDRESS_24_BITS) &&
		     (dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE))) {
			LOG_DBG(" MSPI_IO_MODE_SINGLE in 3Bytes addressing is not supported in "
				"memory map mode, switching to indirect mode");

			int ret = mspi_stm32_ospi_abort_memmap_if_enabled(dev);

			if (ret != 0) {
				return ret;
			}
			goto indirect;
		}

		if (packet->dir == MSPI_RX) {
			return mspi_stm32_ospi_memmap_read(dev, packet);
		}
		if (!dev_data->memmap_cfg.permission) {
			return mspi_stm32_ospi_memmap_write(dev, packet);
		}
	}

indirect:
	(void)pm_device_runtime_get(dev);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	OSPI_RegularCmdTypeDef cmd =
		mspi_stm32_ospi_prepare_cmd(dev_data->dev_cfg.io_mode, dev_data->dev_cfg.data_rate);

	cmd.NbData = packet->num_bytes;
	cmd.Instruction = packet->cmd;
	if (packet->dir == MSPI_TX) {
		cmd.DummyCycles = dev_data->ctx.xfer.tx_dummy;
	} else {
		cmd.DummyCycles = dev_data->ctx.xfer.rx_dummy;
	}
	cmd.Address = packet->address;
	cmd.AddressSize = mspi_stm32_ospi_hal_address_size(dev_data->ctx.xfer.addr_length);
	if (cmd.NbData == 0) {
		cmd.DataMode = HAL_OSPI_DATA_NONE;
	}

	if (dev_data->ctx.xfer.addr_length == 0) {
		/* Commands without an address phase, e.g. RDID or WREN */
		cmd.AddressMode = HAL_OSPI_ADDRESS_NONE;
	}

	LOG_DBG("MSPI access Instruction 0x%x", cmd.Instruction);

	hal_ret = HAL_OSPI_Command(&dev_data->hmspi.ospi, &cmd, HAL_OSPI_TIMEOUT_DEFAULT_VALUE);
	if (hal_ret != HAL_OK) {
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		(void)pm_device_runtime_put(dev);
		LOG_ERR("Failed to send OSPI instruction");
		return -EIO;
	}

	if (packet->num_bytes == 0) {
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		(void)pm_device_runtime_put(dev);
		return 0;
	}

	if (packet->dir == MSPI_RX) {
		/* Receive the data */
		switch (access_mode) {
		case MSPI_ACCESS_SYNC:
			hal_ret = HAL_OSPI_Receive(&dev_data->hmspi.ospi, packet->data_buf,
					       HAL_OSPI_TIMEOUT_DEFAULT_VALUE);
			break;
		case MSPI_ACCESS_ASYNC:
			hal_ret = HAL_OSPI_Receive_IT(&dev_data->hmspi.ospi, packet->data_buf);
			break;
		case MSPI_ACCESS_DMA:
			hal_ret = HAL_OSPI_Receive_DMA(&dev_data->hmspi.ospi, packet->data_buf);
			break;
		default:
			/* Not correct */
			hal_ret = HAL_BUSY;
			break;
		}
	} else {
		/* Transmit the data */
		switch (access_mode) {
		case MSPI_ACCESS_SYNC:
			hal_ret = HAL_OSPI_Transmit(&dev_data->hmspi.ospi, packet->data_buf,
						HAL_OSPI_TIMEOUT_DEFAULT_VALUE);
			break;
		case MSPI_ACCESS_ASYNC:
			hal_ret = HAL_OSPI_Transmit_IT(&dev_data->hmspi.ospi, packet->data_buf);
			break;
		case MSPI_ACCESS_DMA:
			hal_ret = HAL_OSPI_Transmit_DMA(&dev_data->hmspi.ospi, packet->data_buf);
			break;
		default:
			/* Not correct */
			LOG_INF("default");
			hal_ret = HAL_BUSY;
			break;
		}
	}

	if (hal_ret != HAL_OK || access_mode == MSPI_ACCESS_SYNC) {
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		(void)pm_device_runtime_put(dev);

		if (hal_ret != HAL_OK) {
			LOG_ERR("Failed to access data");
			return -EIO;
		}

