zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_ospi.c
	if ((param_mask & MSPI_DEVICE_CONFIG_CPP) != 0) {
		if (dev_cfg->cpp > MSPI_CPP_MODE_3) {
			LOG_ERR("%u, Invalid cpp.", __LINE__);
			return -EINVAL;
		}
		data->dev_cfg.cpp = dev_cfg->cpp;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_ENDIAN) != 0) {
		if (dev_cfg->endian > MSPI_XFER_BIG_ENDIAN) {
			LOG_ERR("%u, Invalid endian.", __LINE__);
			return -EINVAL;
		}
		data->dev_cfg.endian = dev_cfg->endian;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_CE_POL) != 0) {
		if (dev_cfg->ce_polarity > MSPI_CE_ACTIVE_HIGH) {
			LOG_ERR("%u, Invalid ce_polarity.", __LINE__);
			return -EINVAL;
		}
		data->dev_cfg.ce_polarity = dev_cfg->ce_polarity;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_DQS) != 0) {
		if (dev_cfg->dqs_enable && !cfg->mspicfg.dqs_support) {
			LOG_ERR("%u, DQS mode not supported.", __LINE__);
			return -ENOTSUP;
		}
		data->dev_cfg.dqs_enable = dev_cfg->dqs_enable;
	}

	mspi_stm32_ospi_set_cfg(data, param_mask, dev_cfg);

	return 0;
}

/**
 * API implementation of mspi_dev_config : controller device specific configuration
 *
 * @param controller Pointer to the device structure for the driver instance.
 * @param dev_id Pointer to the device ID structure from a device.
 * @param param_mask Macro definition of what to be configured in cfg.
 * @param dev_cfg The device runtime configuration for the MSPI controller.
 *
 * @retval 0 if successful.
 * @retval -EINVAL invalid capabilities, failed to configure device.
 * @retval -ENOTSUP capability not supported by MSPI peripheral.
 */
static int mspi_stm32_ospi_dev_config(const struct device *controller,
				      const struct mspi_dev_id *dev_id,
				      const enum mspi_dev_cfg_mask param_mask,
				      const struct mspi_dev_cfg *dev_cfg)
{
	const struct mspi_stm32_conf *cfg = controller->config;
	struct mspi_stm32_data *data = controller->data;
	int ret = 0;
	bool locked = false;

	if (data->dev_id != dev_id) {
		/* The controller lock is taken here and kept for the whole
		 * session, until the device releases it through
		 * mspi_get_channel_status().
		 */
		if (k_mutex_lock(&data->lock, K_MSEC(CONFIG_MSPI_COMPLETION_TIMEOUT_TOLERANCE))) {
			LOG_ERR("MSPI config failed to access controller.");
			return -EBUSY;
		}

		locked = true;
	}

	if (mspi_stm32_ospi_is_inp(controller)) {
		ret = -EBUSY;
		goto e_return;
	}

	/*
	 * The SFDP is able to change the addr_length 4bytes or 3bytes
	 * this is reflected by the serial_cfg
	 */
	data->dev_id = dev_id;

	if (param_mask == MSPI_DEVICE_CONFIG_NONE && !cfg->mspicfg.sw_multi_periph) {
		return 0;
	}

	/* Go on with other parameters if supported */
	if (mspi_stm32_ospi_dev_cfg_save(controller, param_mask, dev_cfg) != 0) {
		LOG_ERR("failed to set device config");
		ret = -EIO;
		goto e_return;
	}

	return 0;

e_return:

	if (locked) {
		data->dev_id = NULL;
		k_mutex_unlock(&data->lock);
	}

	return ret;
}

/**
 * API implementation of mspi_memmap_config : MemoryMapping configuration
 *
 * @param controller Pointer to the device structure for the driver instance.
 * @param dev_id Pointer to the device ID structure from a device.
 * @param memmap_cfg The controller MemoryMapping configuration for MSPI.
 *
 * @retval 0 if successful.
 * @retval -ESTALE device ID don't match, need to call mspi_dev_config first.
 */
static int mspi_stm32_ospi_memmap_config(const struct device *controller,
					 const struct mspi_dev_id *dev_id,
					 const struct mspi_memmap_cfg *memmap_cfg)
{
	struct mspi_stm32_data *dev_data = controller->data;
	int ret = 0;

	if (dev_id != dev_data->dev_id) {
		LOG_ERR("dev_id don't match");
		return -ESTALE;
	}

	(void)pm_device_runtime_get(controller);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	ospi_lock_thread(controller);

	if (!memmap_cfg->enable) {
		/* This is for aborting */
		ret = mspi_stm32_ospi_memmap_off(controller);
	} else {
		ret = mspi_stm32_ospi_memmap_on(controller);
	}

	if (ret == 0) {
		dev_data->memmap_cfg = *memmap_cfg;
		LOG_INF("MemoryMapping configured");
	}

	ospi_unlock_thread(controller);
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(controller);

	return ret;
}

/**
 * API implementation of mspi_get_channel_status.
 *
 * @param controller Pointer to the device structure for the driver instance.
 * @param ch Not used.
 *
 * @retval 0 if successful.
 * @retval -EBUSY MSPI bus is busy
 */
static int mspi_stm32_ospi_get_channel_status(const struct device *controller, uint8_t ch)
{
	struct mspi_stm32_data *dev_data = controller->data;

	ARG_UNUSED(ch);

	if (mspi_stm32_ospi_is_inp(controller) ||
	    __HAL_OSPI_GET_FLAG(&dev_data->hmspi.ospi, HAL_OSPI_FLAG_BUSY) == SET) {
		return -EBUSY;
	}

	/* The controller is idle: end the session started by
	 * mspi_dev_config() and release the controller lock.
	 */
	dev_data->dev_id = NULL;
	k_mutex_unlock(&dev_data->lock);

	return 0;
}

static int mspi_stm32_ospi_pio_transceive(const struct device *controller,
					  const struct mspi_xfer *xfer)
{
	int ret = 0;
	uint32_t packet_idx;
	struct mspi_stm32_data *dev_data = controller->data;
	struct mspi_stm32_context *ctx = &dev_data->ctx;
	const struct mspi_xfer_packet *packet;

	if (xfer->num_packet == 0 || xfer->packets == NULL ||
	    xfer->timeout > CONFIG_MSPI_COMPLETION_TIMEOUT_TOLERANCE) {
		LOG_ERR("Transfer: wrong parameters");
		return -EFAULT;
	}

	/* DummyCycle to give to the mspi_stm32_read_access/mspi_stm32_write_access */
	ret = mspi_stm32_ospi_context_lock(ctx, dev_data->dev_id, xfer, true);
	if (ret != 0) {
		return ret;
	}

	/* Asynchronous transfer call read/write with IT and callback function */
	while (ctx->packets_left > 0) {
		packet_idx = ctx->xfer.num_packet - ctx->packets_left;
		packet = &ctx->xfer.packets[packet_idx];

		ret = mspi_stm32_ospi_access(
			controller, packet, ctx->xfer.async ? MSPI_ACCESS_ASYNC : MSPI_ACCESS_SYNC);

		if (ret != 0) {
			ret = -EIO;
			goto pio_end;
		}
		ctx->packets_left--;
	}

