zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_ospi.c
pio_end:
	mspi_stm32_ospi_context_unlock(ctx);
	return ret;
}

#ifdef CONFIG_MSPI_DMA
static int mspi_stm32_ospi_dma_transceive(const struct device *controller,
					  const struct mspi_xfer *xfer)
{
	int ret = 0;
	struct mspi_stm32_data *dev_data = controller->data;
	struct mspi_stm32_context *ctx = &dev_data->ctx;
	const struct mspi_stm32_conf *dev_conf = controller->config;
	const struct mspi_xfer_packet *packet;

	if (!dev_conf->dma_specified) {
		LOG_ERR("DMA configuration is missing from the device tree");
		return -EIO;
	}

	if (xfer->num_packet == 0 || xfer->packets == NULL ||
	    xfer->timeout > CONFIG_MSPI_COMPLETION_TIMEOUT_TOLERANCE) {
		return -EFAULT;
	}

	ret = mspi_stm32_ospi_context_lock(ctx, dev_data->dev_id, xfer, true);

	if (ret != 0) {
		return ret;
	}

	while (ctx->packets_left > 0) {
		uint32_t packet_idx = ctx->xfer.num_packet - ctx->packets_left;

		packet = &ctx->xfer.packets[packet_idx];

		ret = mspi_stm32_ospi_access(controller, packet, MSPI_ACCESS_DMA);

		ctx->packets_left--;
		if (ret != 0) {
			ret = -EIO;
			goto dma_end;
		}
	}

dma_end:
	mspi_stm32_ospi_context_unlock(ctx);
	return ret;
}
#endif

/**
 * API implementation of mspi_transceive.
 *
 * @param controller Pointer to the device structure for the driver instance.
 * @param dev_id Pointer to the device ID structure from a device.
 * @param xfer Pointer to the MSPI transfer started by dev_id.
 *
 * @retval 0 if successful.
 * @retval -ESTALE device ID don't match, need to call mspi_dev_config first.
 * @retval A negative errno value upon failure.
 */
static int mspi_stm32_ospi_transceive(const struct device *controller,
				      const struct mspi_dev_id *dev_id,
				      const struct mspi_xfer *xfer)
{
	struct mspi_stm32_data *dev_data = controller->data;

	if (dev_id != dev_data->dev_id) {
		LOG_ERR("transceive : dev_id don't match");
		return -ESTALE;
	}

	/* Need to map the xfer to the data context */
	dev_data->ctx.xfer = *xfer;

	/*
	 * async + MSPI_PIO : Use callback on Irq if PIO
	 * sync + MSPI_PIO use timeout (mainly for NOR command and param
	 * MSPI_DMA : async/sync is meaningless with DMA (no DMA IT function)t
	 */
	if ((xfer->packets->cmd == MSPI_NOR_OCMD_RDSR) ||
	    (xfer->packets->cmd == MSPI_NOR_CMD_RDSR)) {
		/* This is a command and an autopolling on the status register */
		return mspi_stm32_ospi_status_reg(controller, xfer);
	}
#ifdef CONFIG_MSPI_DMA
	return mspi_stm32_ospi_dma_transceive(controller, xfer);
#endif
	if (xfer->xfer_mode == MSPI_PIO) {
		return mspi_stm32_ospi_pio_transceive(controller, xfer);
	} else {
		return -EIO;
	}
}

#if defined(CONFIG_MSPI_DMA) && !defined(HAL_MDMA_MODULE_ENABLED)
static int mspi_stm32_ospi_dma_setup(const struct mspi_stm32_conf *dev_cfg,
				     struct mspi_stm32_data *dev_data)
{
	int ret = 0;

	struct dma_config dma_cfg = dev_data->dma.cfg;
	DMA_HandleTypeDef *hdma = &dev_data->hdma;

	dev_data->dma.reg = (DMA_TypeDef *)dev_data->dma.phys_addr;

	if (!device_is_ready(dev_data->dma.dev)) {
		LOG_ERR("%s device not ready", dev_data->dma.dev->name);
		return -ENODEV;
	}

	dma_cfg.user_data = hdma;
	dma_cfg.channel_direction = PERIPHERAL_TO_MEMORY;
	dma_cfg.linked_channel = STM32_DMA_HAL_OVERRIDE;

	ret = dma_config(dev_data->dma.dev, dev_data->dma.channel, &dma_cfg);
	if (ret != 0) {
		LOG_ERR("Failed to configure DMA channel %d", dev_data->dma.channel);
		return ret;
	}

	ret = dma_stm32_zcfg_to_halcfg(dev_data->dma.dev, &dma_cfg, &hdma->Init,
				       DMA_ADDR_ADJ_NO_CHANGE, DMA_ADDR_ADJ_INCREMENT);
	if (ret < 0) {
		return ret;
	}

#ifdef CONFIG_DMA_STM32U5
	hdma->Init.TransferAllocatedPort = DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT1;
#endif

	hdma->Instance = STM32_DMA_GET_INSTANCE(dev_data->dma.reg, dev_data->dma.channel);
	__HAL_LINKDMA(&dev_data->hmspi.ospi, hdma, *hdma);
	if (HAL_DMA_Init(hdma) != HAL_OK) {
		LOG_ERR("OSPI DMA Init failed");
		return -EIO;
	}
	LOG_DBG("OSPI with DMA Transfer");

	return ret;
}

static __maybe_unused void mspi_stm32_ospi_dma_callback(const struct device *dev, void *arg,
							uint32_t channel, int status)
{
	DMA_HandleTypeDef *hdma = arg;

	ARG_UNUSED(dev);
	ARG_UNUSED(channel);

	if (status < 0) {
		LOG_ERR("DMA callback error with channel %d", channel);
	}

	HAL_DMA_IRQHandler(hdma);
}
#endif /* CONFIG_MSPI_DMA && !HAL_MDMA_MODULE_ENABLED */

static int mspi_stm32_ospi_conf_validate(const struct mspi_cfg *config, uint32_t max_frequency)
{
	/* Only Controller mode is supported */
	if (config->op_mode != MSPI_OP_MODE_CONTROLLER) {
		LOG_ERR("Only support MSPI controller mode.");
		return -ENOTSUP;
	}

	/* Check the max possible freq. */
	if (config->max_freq > max_frequency) {
		LOG_ERR("Max_freq %d too large.", config->max_freq);
		return -ENOTSUP;
	}

	if (config->duplex != MSPI_HALF_DUPLEX) {
		LOG_ERR("Only support half duplex mode.");
		return -ENOTSUP;
	}

	if (config->num_periph > MSPI_MAX_DEVICE) {
		LOG_ERR("Invalid MSPI peripheral number.");
		return -ENOTSUP;
	}

	return 0;
}

static int mspi_stm32_ospi_activate(const struct device *dev)
{
	int ret;
	const struct mspi_stm32_conf *config = (const struct mspi_stm32_conf *)dev->config;

	ret = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		return ret;
	}

	if (config->pclk_len > 1) {
		if (clock_control_configure(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
					    (clock_control_subsys_t)&config->pclken[1],
					    NULL) != 0) {
			LOG_ERR("Could not select OSPI domain clock");
			return -EIO;
		}
	}

	/* Clock configuration */
	if (clock_control_on(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
			     (clock_control_subsys_t)(uintptr_t)&config->pclken[0]) != 0) {
		LOG_ERR("Could not enable OSPI clock");
		return -EIO;
	}

	return 0;
}

static int mspi_stm32_ospi_clock_config(struct mspi_stm32_data *dev_data,
					const struct mspi_stm32_conf *dev_cfg)
{
	uint32_t ahb_clock_freq;
	uint32_t prescaler = MSPI_STM32_CLOCK_PRESCALER_MIN;

	/* Max 3 domain clock are expected */
	if (dev_cfg->pclk_len > 3) {
		LOG_ERR("Could not select %d OSPI domain clock", dev_cfg->pclk_len);
		return -EIO;
	}

	if (clock_control_get_rate(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				   (clock_control_subsys_t)&dev_cfg->pclken[0],
				   &ahb_clock_freq) < 0) {
		LOG_ERR("Failed call clock_control_get_rate(pclken)");
		return -EIO;
	}

