zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_ospi.c
	/* Alternate clock config for peripheral if any */
	if (dev_cfg->pclk_len > 1) {
		if (clock_control_get_rate(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
					   (clock_control_subsys_t)&dev_cfg->pclken[1],
					   &ahb_clock_freq) < 0) {
			LOG_ERR("Failed call clock_control_get_rate(pclken)");
			return -EIO;
		}
	}

	if (dev_cfg->pclk_len > 2) {
		if (clock_control_on(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				     (clock_control_subsys_t)&dev_cfg->pclken[2]) != 0) {
			LOG_ERR("Could not enable OSPI Manager clock");
			return -EIO;
		}
	}

	for (prescaler = MSPI_STM32_CLOCK_PRESCALER_MIN;
	     prescaler <= MSPI_STM32_CLOCK_PRESCALER_MAX; prescaler++) {
		dev_data->dev_cfg.freq = MSPI_STM32_CLOCK_COMPUTE(ahb_clock_freq, prescaler);

		if (dev_data->dev_cfg.freq <= dev_cfg->mspicfg.max_freq) {
			break;
		}
	}
	__ASSERT_NO_MSG(prescaler <= MSPI_STM32_CLOCK_PRESCALER_MAX);

	/* Initialize XSPI HAL structure completely */
	dev_data->hmspi.ospi.Init.ClockPrescaler = prescaler;

	return 0;
}

/**
 * API implementation of mspi_config : controller configuration.
 *
 * @param spec Pointer to MSPI device tree spec.
 * @return 0 if successful.
 * @return A negative errno value upon failure.
 */
static int mspi_stm32_ospi_config(const struct mspi_dt_spec *spec)
{
	const struct mspi_cfg *config = &spec->config;
	const struct mspi_stm32_conf *dev_cfg = spec->bus->config;
	struct mspi_stm32_data *dev_data = spec->bus->data;
	int ret = 0;

	ret = mspi_stm32_ospi_conf_validate(config, dev_cfg->mspicfg.max_freq);
	if (ret != 0) {
		return ret;
	}

	dev_data->hmspi.ospi.Instance = dev_cfg->base;
	(void)pm_device_runtime_get(spec->bus);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	ret = pinctrl_apply_state(dev_cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("MSPI pinctrl setup failed");
		goto end;
	}

	if (dev_data->dev_cfg.dqs_enable && !dev_cfg->mspicfg.dqs_support) {
		LOG_ERR("MSPI dqs mismatch (not supported but enabled)");
		ret = -ENOTSUP;
		goto end;
	}

	dev_cfg->irq_config();
	ret = mspi_stm32_ospi_activate(spec->bus);
	if (ret != 0) {
		goto end;
	}

	ret = mspi_stm32_ospi_clock_config(dev_data, dev_cfg);
	if (ret != 0) {
		goto end;
	}

	/** The stm32 hal_mspi driver does not reduce DEVSIZE before writing the DCR1
	 * dev_data->hmspi.ospi.Init.MemorySize = find_lsb_set(dev_cfg->reg_size) - 2;
	 * dev_data->hmspi.ospi.Init.MemorySize is mandatory now (BUSY = 0) for HAL_XSPI Init
	 * give the value from the child node
	 */
#if defined(XSPI_DCR2_WRAPSIZE)
	dev_data->hmspi.ospi.Init.WrapSize = HAL_XSPI_WRAP_NOT_SUPPORTED;
#endif /* XSPI_DCR2_WRAPSIZE */
#if MSPI_STM32_DLYB_BYPASSED
	dev_data->hmspi.ospi.Init.DelayBlockBypass = HAL_OSPI_DELAY_BLOCK_BYPASSED;
#else
	dev_data->hmspi.ospi.Init.DelayBlockBypass = HAL_OSPI_DELAY_BLOCK_USED;
#endif /* MSPI_STM32_DLYB_BYPASSED */

	/* Enable DHQC for high frequencies >= 100MHZ */
	if (dev_cfg->mspicfg.max_freq > 100000000U) {
		dev_data->hmspi.ospi.Init.DelayHoldQuarterCycle = HAL_OSPI_DHQC_ENABLE;
	}

	if (HAL_OSPI_Init(&dev_data->hmspi.ospi) != HAL_OK) {
		LOG_ERR("MSPI Init failed");
		ret = -EIO;
		goto end;
	}

	LOG_DBG("MSPI Init'd");
#if defined(OCTOSPIM)
	/* OCTOSPI I/O manager init Function */
	OSPIM_CfgTypeDef ospi_mgr_cfg = {0};

	ospi_mgr_cfg.ClkPort    = dev_cfg->ospim_clk_port;
	ospi_mgr_cfg.DQSPort    = dev_cfg->ospim_dqs_port;
	ospi_mgr_cfg.NCSPort    = dev_cfg->ospim_ncs_port;
	ospi_mgr_cfg.IOLowPort  = dev_cfg->ospim_io_low_port;
	ospi_mgr_cfg.IOHighPort = dev_cfg->ospim_io_high_port;

	if (dev_data->hmspi.ospi.Instance != OCTOSPI1 &&
		dev_data->hmspi.ospi.Instance != OCTOSPI2) {
		LOG_ERR("Unknown OSPI Instance");
		ret = -EINVAL;
		goto end;
	}
#if defined(OCTOSPIM_CR_MUXEN)
	ospi_mgr_cfg.Req2AckTime = 1;
#endif /* OCTOSPIM_CR_MUXEN */
	if (HAL_OSPIM_Config(&dev_data->hmspi.ospi, &ospi_mgr_cfg,
			     HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
		LOG_ERR("OSPI M config failed");
		ret = -EIO;
		goto end;
	}
#if defined(CONFIG_SOC_SERIES_STM32U5X)
	/* OCTOSPI2 delay block init Function */
	HAL_OSPI_DLYB_CfgTypeDef ospi_delay_block_cfg = {0};

	(void)HAL_OSPI_DLYB_GetClockPeriod(&dev_data->hmspi.ospi, &ospi_delay_block_cfg);
	ospi_delay_block_cfg.PhaseSel /= 4;
	if (HAL_OSPI_DLYB_SetConfig(&dev_data->hmspi.ospi, &ospi_delay_block_cfg) != HAL_OK) {
		LOG_ERR("OSPI DelayBlock failed");
		ret = -EIO;
		goto end;
	}
#endif /* CONFIG_SOC_SERIES_STM32U5X */

#endif /* OCTOSPIM */
#if defined(CONFIG_MSPI_DMA) && !defined(HAL_MDMA_MODULE_ENABLED)
	if (dev_cfg->dma_specified) {
		mspi_stm32_ospi_dma_setup(dev_cfg, dev_data);
	}
#endif

	if (k_sem_count_get(&dev_data->ctx.lock) == 0) {
		mspi_stm32_ospi_context_unlock(&dev_data->ctx);
	}

	if (config->re_init) {
		/* Force-release a session that may still hold the lock */
		dev_data->dev_id = NULL;
		k_mutex_unlock(&dev_data->lock);
	}
	k_sem_init(&dev_data->thread_sem, 1, 1);
end:
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(spec->bus);

	LOG_DBG("MSPI config result: %s", (ret == 0) ? "success" : "failed");

	return ret;
}

/**
 * Set up a new controller and add its child to the list.
 *
 * @param dev MSPI emulation controller.
 *
 * @retval 0 if successful.
 */
static int mspi_stm32_ospi_init(const struct device *controller)
{
	const struct mspi_stm32_conf *cfg = controller->config;
	const struct mspi_dt_spec spec = {
		.bus = controller,
		.config = cfg->mspicfg,
	};

	return mspi_stm32_ospi_config(&spec);
}

#if defined(CONFIG_MSPI_TIMING)
static int mspi_stm32_ospi_timing_config(const struct device *dev,
					 const struct mspi_dev_id *dev_id,
					 const uint32_t param_mask, void *cfg)
{
	struct mspi_stm32_data *dev_data = dev->data;
	struct mspi_stm32_timing_cfg *config = cfg;

	if (config->turnaround_cycles != 0) {
		/* Required for PSRAM where tx_dummy = total latency (WLC),
		 * while STM32 XSPI expects dummy cycles excluding turnaround.
		 */
		dev_data->dev_cfg.tx_dummy = dev_data->dev_cfg.tx_dummy - config->turnaround_cycles;
	}

