zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_ospi.c
	return 0;
}
#endif /* defined(CONFIG_MSPI_TIMING) */

static DEVICE_API(mspi, mspi_stm32_driver_api) = {
	.config = mspi_stm32_ospi_config,
	.dev_config = mspi_stm32_ospi_dev_config,
	.memmap_config = mspi_stm32_ospi_memmap_config,
	.get_channel_status = mspi_stm32_ospi_get_channel_status,
	.transceive = mspi_stm32_ospi_transceive,
	#if defined(CONFIG_MSPI_TIMING)
		.timing_config = mspi_stm32_ospi_timing_config,
	#endif
};

#ifdef CONFIG_PM_DEVICE
static int mspi_stm32_ospi_suspend(const struct device *dev)
{
	int ret;
	const struct mspi_stm32_conf *cfg = (struct mspi_stm32_conf *)dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	/* Disable device clock. */
	ret = clock_control_off(clk, (clock_control_subsys_t)(uintptr_t)&cfg->pclken[0]);
	if (ret < 0) {
		LOG_ERR("Failed to disable MSPI clock during PM suspend process");
		return ret;
	}

	/* Optional alternate clocks */
	if (cfg->pclk_len > 1) {
		if (clock_control_off(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				      (clock_control_subsys_t)&cfg->pclken[1]) != 0) {
			LOG_ERR("Could not enable XSPI Manager clock");
			return -EIO;
		}
	}

	if (cfg->pclk_len > 2) {
		if (clock_control_off(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				      (clock_control_subsys_t)&cfg->pclken[2]) != 0) {
			LOG_ERR("Could not enable XSPI Manager clock");
			return -EIO;
		}
	}

	/* Move pins to sleep state */
	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_SLEEP);
	if (ret == -ENOENT) {
		/* Warn but don't block suspend */
		LOG_WRN_ONCE("MSPI pinctrl sleep state not available");
		return 0;
	}

	return ret;
}

static int mspi_stm32_ospi_pm_action(const struct device *dev, enum pm_device_action action)
{
	switch (action) {
	case PM_DEVICE_ACTION_RESUME:
		return mspi_stm32_ospi_activate(dev);
	case PM_DEVICE_ACTION_SUSPEND:
		return mspi_stm32_ospi_suspend(dev);
	default:
		return -ENOTSUP;
	}
}
#endif /* CONFIG_PM_DEVICE */

#if CONFIG_MSPI_DMA
#define DMA_CHANNEL_CONFIG(node, dir) DT_DMAS_CELL_BY_NAME(node, dir, channel_config)

#define OSPI_DMA_CHANNEL_INIT(node, dir)                                                           \
	.dev = DEVICE_DT_GET(DT_DMAS_CTLR(node)),                                                  \
	.channel = DT_DMAS_CELL_BY_NAME(node, dir, channel),                                       \
	.phys_addr = DT_REG_ADDR(DT_DMAS_CTLR(node)),                                              \
	.cfg = {                                                                                   \
		.dma_slot = DT_DMAS_CELL_BY_NAME(node, dir, slot),                                 \
		.source_data_size =                                                                \
			STM32_DMA_CONFIG_PERIPHERAL_DATA_SIZE(DMA_CHANNEL_CONFIG(node, dir)),      \
		.dest_data_size =                                                                  \
			STM32_DMA_CONFIG_MEMORY_DATA_SIZE(DMA_CHANNEL_CONFIG(node, dir)),          \
		.channel_priority = STM32_DMA_CONFIG_PRIORITY(DMA_CHANNEL_CONFIG(node, dir)),      \
		.dma_callback = mspi_stm32_ospi_dma_callback,                                      \
	},

#define OSPI_DMA_CHANNEL(node, dir)                                                                \
	.dma = {                                                                                   \
		COND_CODE_1(DT_DMAS_HAS_NAME(node, dir),                                           \
			    (OSPI_DMA_CHANNEL_INIT(node, dir)),                                    \
			    (NULL))                                                                \
	},
#else
#define OSPI_DMA_CHANNEL(node, dir)
#endif
/* MSPI control config */
#define MSPI_CONFIG(index)                                                                         \
	{                                                                                          \
		.channel_num = 0,                                                                  \
		.op_mode = DT_INST_ENUM_IDX_OR(index, op_mode, MSPI_OP_MODE_CONTROLLER),           \
		.duplex = DT_INST_ENUM_IDX_OR(index, duplex, MSPI_HALF_DUPLEX),                    \
		.max_freq = DT_INST_PROP(index, clock_frequency),                                  \
		.dqs_support = DT_INST_PROP(index, dqs_support),                                   \
		.num_periph = DT_INST_CHILD_NUM(index),                                            \
		.sw_multi_periph = DT_INST_PROP(index, software_multiperipheral),                  \
	}

#define STM32_SMPI_IRQ_HANDLER(index)                                                              \
	static void mspi_stm32_irq_config_func_##index(void)                                       \
	{                                                                                          \
		IRQ_CONNECT(DT_INST_IRQN(index), DT_INST_IRQ(index, priority),                     \
			    mspi_stm32_ospi_isr, DEVICE_DT_INST_GET(index), 0);                    \
		irq_enable(DT_INST_IRQN(index));                                                   \
	}

#define MSPI_STM32_INIT(index)                                                                     \
	BUILD_ASSERT(OSPI_INST_NUM(index) != 0,                                                    \
		     "Unsupported OSPI instance: DTS node must be octospi1 or octospi2");          \
                                                                                                   \
	MSPI_STM32_VALIDATE_MEMTYPE(MSPI_STM32_MEMTYPE_TOKEN(index));                              \
                                                                                                   \
	static const struct stm32_pclken pclken_##index[] = STM32_DT_INST_CLOCKS(index);           \
                                                                                                   \
	PINCTRL_DT_INST_DEFINE(index);                                                             \
                                                                                                   \
	static struct gpio_dt_spec ce_gpios##index[] = MSPI_CE_GPIOS_DT_SPEC_INST_GET(index);      \
                                                                                                   \
	STM32_SMPI_IRQ_HANDLER(index)                                                              \
                                                                                                   \
	static const struct mspi_stm32_conf mspi_stm32_dev_conf_##index = {                        \
		.base = (void *)DT_INST_REG_ADDR(index),					   \
		.pclken = pclken_##index,                                                          \
		.pclk_len = DT_INST_NUM_CLOCKS(index),                                             \
		.irq_config = mspi_stm32_irq_config_func_##index,                                  \
		.mspicfg = MSPI_CONFIG(index),                                                     \
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),                                     \
		.mspicfg.num_ce_gpios = ARRAY_SIZE(ce_gpios##index),                               \
		.dma_specified = DT_INST_NODE_HAS_PROP(index, dmas),                               \
		.ospim_clk_port = DT_INST_PROP_OR(index, st_clk_port,                              \
						   OSPI_INST_NUM(index)),                          \
		.ospim_dqs_port = DT_INST_PROP_OR(index, st_dqs_port, 0),                         \
		.ospim_ncs_port = DT_INST_PROP_OR(index, st_ncs_port,                              \
						   OSPI_INST_NUM(index)),                          \
		.ospim_io_low_port = DT_OSPI_IO_PORT_PROP_OR(st_io_low_port,                      \
						      OSPI_INST_IO_LOW_PORT(index), index),        \
		.ospim_io_high_port = DT_OSPI_IO_PORT_PROP_OR(st_io_high_port,                    \
						       OSPI_INST_IO_HIGH_PORT(index), index),      \
	};                                                                                         \
	static struct mspi_stm32_data mspi_stm32_dev_data_##index = {                              \
		.hmspi.ospi = {                                                                    \
			.Init = {                                                                  \
				.FifoThreshold = MSPI_STM32_FIFO_THRESHOLD,                        \
				.SampleShifting = (DT_INST_PROP(index, st_ssht_enable) ?           \
						  HAL_OSPI_SAMPLE_SHIFTING_HALFCYCLE :             \
						  HAL_OSPI_SAMPLE_SHIFTING_NONE),                  \
				.ChipSelectHighTime = 1,                                           \
				.ClockMode = HAL_OSPI_CLOCK_MODE_0,                                \
				.ChipSelectBoundary = DT_INST_PROP(index, st_csbound),             \
				.DeviceSize = MSPI_STM32_INST_MEM_ADDR_BITS(index, 26),            \
				.MemoryType = MSPI_STM32_HAL_MEMTYPE(index),                       \
				.FreeRunningClock = HAL_OSPI_FREERUNCLK_DISABLE,                   \
			},                                                                         \
		},                                                                                 \
		.memmap_base_addr = DT_INST_REG_ADDR_BY_IDX(index, 1),                             \
		.lock = Z_MUTEX_INITIALIZER(mspi_stm32_dev_data_##index.lock),                     \
		.sync = Z_SEM_INITIALIZER(mspi_stm32_dev_data_##index.sync, 0, 1),                 \
		.dev_cfg = {0},                                                                    \
		.memmap_cfg = {0},                                                                 \
		.ctx.lock = Z_SEM_INITIALIZER(mspi_stm32_dev_data_##index.ctx.lock, 0, 1),         \
		OSPI_DMA_CHANNEL(DT_DRV_INST(index), tx_rx)                                        \
	};                                                                                         \
                                                                                                   \
	PM_DEVICE_DT_INST_DEFINE(index, mspi_stm32_ospi_pm_action);                                \
	DEVICE_DT_INST_DEFINE(index, &mspi_stm32_ospi_init, PM_DEVICE_DT_INST_GET(index),          \
			      &mspi_stm32_dev_data_##index, &mspi_stm32_dev_conf_##index,          \
			      POST_KERNEL, CONFIG_KERNEL_INIT_PRIORITY_DEVICE,                     \
			      &mspi_stm32_driver_api);

DT_INST_FOREACH_STATUS_OKAY(MSPI_STM32_INIT)
